#Q1

In [1]:
#Q!
import pandas as pd
pd.Series([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#Q2

In [2]:
#Q2
l=[1,2,3,4,5,6,7,8,9,10]
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

#Q3

In [5]:
#Q3
d={"Name":['Alice',
'Bob',
'Claire'],"Age":[25,30,27],"Gender":['Female','Male','Female']}
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Q4

In [ ]:
#Q4
-->DataFrame are the combination of rows and columns just like the tabular format
-->Series are similar to list containing either single row or single columns
-->only difference of Series from the list is that it prints the index of element as well unlike list where the indices are hidden

In [6]:
#Q4
#For example
pd.DataFrame(d)  # this is example of dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [7]:
#storing it in a variable
df=pd.DataFrame(d)
df['Name']  #This is Series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

#Q5

In [8]:
#q5
df.head(3)  #-->to give the first 3 information of the datas , if we don't mention the parameter by default it is 5

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
df.tail()  #-->print the last 5 rows

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
df.columns  #-->info about the columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [13]:
df.dtypes  #-->types of datatypes present in each column

Name      object
Age        int64
Gender    object
dtype: object

In [14]:
df.info()  #-->info about the whole Tables

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [16]:
df.to_excel("demo.xlsx")  #-->convert to excel format

In [17]:
df.to_csv('csv_dem0.csv') #--->convert to csv format

In [ ]:
#Similarly to read excel ,csv and html files
we have,
df.read_csv('file_name.csv')
df.read_excel('file_name.xlsx')
df.read_html('file_name.html')

#Q6

In [18]:
#panda series is mutable
s=pd.Series([1,2,3])

In [19]:
s[2]=35 #value of index 2 to 35

In [20]:
print(s)

0     1
1     2
2    35
dtype: int64

In [28]:
#panda DataFrame is also mutable
d=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]},index=None)
d

   A  B
0  1  4
1  2  5
2  3  6

In [23]:
#changing the value of 5 to 25
d['B'][1]=25

In [24]:
d

   A   B
0  1   4
1  2  25
2  3   6

#Q7

In [27]:
column1=[1,2,3]
column2=['a','b','c']
column3=[1.2,3.4,4.3]
df=pd.DataFrame({"intType":column1,"charType":column2,"floatType":column3},index=None)
df

   intType charType  floatType
0        1        a        1.2
1        2        b        3.4
2        3        c        4.3